import random

# list1 = []
# 方式1  生成随机列表
ran = random.randint(1, 25)
# list1 = range(1, ran)  # 暂时注释掉

# 方式2 生成自己要的长度的列表
list1 = range(900)

# 测试 成员数:0 1 9 10 11  19 20 21
print(list1)

# for i in list1:
#     print(i)
for i in range(len(list1)):
    print(list1[i]) if i == len(list1) - 1 else print(list1[i], end=',')

# ★我的笔记1:不能写成 可拆分组数=int(数组成员数/10)+ 1 # ★因为比如10个成员 正好分1页  但是这种写法就分2页了
# 可拆分组数=int((数组成员数-1) /10)+1  -->好像就可以了  ★但这个没办法处理 成员为0的情况
# ★处理原则:::先处理大众,再单独适配特殊

# ★我的笔记:数组成员数0个的问题
# 绝对取整
数组成员数 = len(list1)

# 写法1:
# if 数组成员数 == 0:  # 单独处理 数组数为0 的情况
#     可拆分组数 = 0
# else:
#     可拆分组数 = int((数组成员数 - 1) / 10) + 1
# print('数组成员数:', 数组成员数, '可拆分组数:', 可拆分组数)

# ★我的笔记: 这种写法的逻辑 就是 一个盒子/列表 最多只能放10个,
# 写法2

r"""
★★★我的笔记:整理:页码的计算: 页数:数量  mod_div(商,余数)   //
    1	2	3	4	5	6  7	8	9	10
1页 (0,1) (0,2) (0,3) (0,4)	(0,5) ....(0,8)	(0,9)	(1,0)
    11	12	13	14	15	16  17	18	19	20
2页 (1,1) (1,2) (1,3) (1,4)	(1,5) ....(1,8)	(1,9)	(2,0)
    21	22	23	24	25	26  27	28	29	30
3页 (2,1) (2,2) (2,3) (2,4)	(2,5) ....(2,8)	(2,9)	(3,0)
★★★结论:总数量对每页显示的数量求余,@余数==0,页码数=商@余数>0,页码数=商+1 // 也可以else 也可以写不等于!=
★★★理解:商 就是最少页数.当 0 < 余数 <  10 这些就需要再开一页  =0 则不需要再开一页
"""
# if 数组成员数 % 10 == 0:
#     可拆分组数 = int(数组成员数 / 10)
# else:
#     可拆分组数 = int(数组成员数 / 10) + 1

# 可拆分组数 = int(数组成员数 / 10)  if 数组成员数 % 10 == 0 else int(数组成员数 / 10) + 1
可拆分组数 = 数组成员数 // 10 if 数组成员数 % 10 == 0 else 数组成员数 // 10 + 1

# 1组 就是range(1) [0]  #2组就是rang(2) [0,1]     #类似for next里面的次数循环
for i in range(可拆分组数):
    # newList = []  # 每次清空新列表  --> 不用了吧  下面有重复赋值的
    # 比如有5个 list1[0,1,2,3,4]  新列表 就会 添加
    # 比如有10个 新列表 [1,2,3,4,5,7...10]
    # 比如有11个 新列表 [1,2,3,4,5,7...10]   [11]
    '''
        if i < (可拆分组数 - 1):newList = list1[i * 10: i * 10 + 10]
            # for x in range(10):
            # 非最终轮//非末尾轮  那肯定有10个
            # 该轮次(i) 从第一个开始 依次添加10个
        if i == (可拆分组数 - 1):newList = list1[i * 10:]
            # 最终轮 末尾轮
            # 该轮次(i) 从第一个开始,依次添加多出的那几个
            # 如果是正好整轮比如10 个 这里余数就为空了 就有问题了
    '''
    # newList = list1[i * 10:] if i == (可拆分组数 - 1) else list1[i * 10: i * 10 + 10]
    newList = list1[i * 10: i * 10 + 10]
    # ★原因:这里如果是末尾一轮不足10个,也不会报错,到达上限就停止,可以不用管
    print('newList:', newList)  # 当前轮次 列表
    for n in range(len(newList)):  # 比如6个成员 i: 0~5   len(newList)=6
        print(newList[n]) if n == len(newList) - 1 else print(newList[n], end=',')
