Repository: pypi-data/pypi-mirror-139
Catalog: packages/m9s-translation-override-*/m9s_translation_override_*-6.0.0.tar.gz/m9s_translation_override_*-6.0.0/locale/override/account_dunning_*.po
Languages: de

# field:account.configuration,default_dunning_procedure:account_dunning.
source: Default Dunning Procedure
de: Standardmahnprozess

source: Create Date
de: Erstellungsdatum

source: Create User
de: Erstellt durch

source: Default Dunning Procedure
de: Standardmahnprozess

# field:account.configuration.default_dunning_procedure,rec_name:account_dunning.
source: Record Name
de: Name

source: Write Date
de: Zuletzt geändert

# field:account.configuration.default_dunning_procedure,write_uid:account_dunning.
source: Write User
de: Letzte Änderung durch

# field:account.dunning,active:account_dunning.
source: Active
de: Aktiv

# field:account.dunning,amount:account_dunning.
source: Amount
de: Betrag

# field:account.dunning,amount_second_currency:account_dunning.
source: Amount Second Currency
de: Fremdwährungsbetrag

# field:account.dunning,blocked:account_dunning.
source: Blocked
de: Gesperrt

# field:account.dunning,company:account_dunning.
source: Company
de: Unternehmen

# field:account.dunning,create_date:account_dunning.
source: Create Date
de: Erstellungsdatum

# field:account.dunning,create_uid:account_dunning.
source: Create User
de: Erstellt durch

# field:account.dunning,currency_digits:account_dunning.
source: Currency Digits
de: Nachkommastellen Währung

# field:account.dunning,level:account_dunning.
source: Level
de: Stufe

# field:account.dunning,line:account_dunning.
source: Line
de: Position

# field:account.dunning,maturity_date:account_dunning.
source: Maturity Date
de: Fälligkeitsdatum

# field:account.dunning,party:account_dunning.
source: Party
de: Partei

# field:account.dunning,procedure:account_dunning.
source: Procedure
de: Verfahren

# field:account.dunning,rec_name:account_dunning.
source: Record Name
de: Name

# field:account.dunning,second_currency:account_dunning.
source: Second Currency
de: Fremdwährung

# field:account.dunning,second_currency_digits:account_dunning.
source: Second Currency Digits
de: Nachkommastellen Fremdwährung

# field:account.dunning,state:account_dunning.
source: State
de: Status

# field:account.dunning,write_date:account_dunning.
source: Write Date
de: Zuletzt geändert

# field:account.dunning,write_uid:account_dunning.
source: Write User
de: Letzte Änderung durch

# field:account.dunning.create.start,date:account_dunning.
source: Date
de: Datum

# field:account.dunning.level,create_date:account_dunning.
source: Create Date
de: Erstellungsdatum

# field:account.dunning.level,create_uid:account_dunning.
source: Create User
de: Erstellt durch

# field:account.dunning.level,overdue:account_dunning.
source: Overdue
de: Überfällig

# field:account.dunning.level,procedure:account_dunning.
source: Procedure
de: Verfahren

# field:account.dunning.level,rec_name:account_dunning.
source: Record Name
de: Name

# field:account.dunning.level,sequence:account_dunning.
source: Sequence
de: Reihenfolge

# field:account.dunning.level,write_date:account_dunning.
source: Write Date
de: Zuletzt geändert

# field:account.dunning.level,write_uid:account_dunning.
source: Write User
de: Letzte Änderung durch

# field:account.dunning.procedure,create_date:account_dunning.
source: Create Date
de: Erstellungsdatum

# field:account.dunning.procedure,create_uid:account_dunning.
source: Create User
de: Erstellt durch

# field:account.dunning.procedure,levels:account_dunning.
source: Levels
de: Stufen

# field:account.dunning.procedure,rec_name:account_dunning.
source: Record Name
de: Name

# field:account.dunning.procedure,write_date:account_dunning.
source: Write Date
de: Zuletzt geändert

# field:account.dunning.procedure,write_uid:account_dunning.
source: Write User
de: Letzte Änderung durch

# field:account.move.line,dunnings:account_dunning.
source: Dunnings
de: Mahnungen

# field:party.party,dunning_procedure:account_dunning.
source: Dunning Procedure
de: Mahnprozess

# field:party.party,dunning_procedures:account_dunning.
source: Dunning Procedures
de: Mahnprozess

# field:party.party.dunning_procedure,create_date:account_dunning.
source: Create Date
de: Erstellungsdatum

# field:party.party.dunning_procedure,create_uid:account_dunning.
source: Create User
de: Erstellt durch

# field:party.party.dunning_procedure,dunning_procedure:account_dunning.
source: Dunning Procedure
de: Mahnprozess

# field:party.party.dunning_procedure,party:account_dunning.
source: Party
de: Partei

# field:party.party.dunning_procedure,rec_name:account_dunning.
source: Record Name
de: Name

# field:party.party.dunning_procedure,write_date:account_dunning.
source: Write Date
de: Zuletzt geändert

# field:party.party.dunning_procedure,write_uid:account_dunning.
source: Write User
de: Letzte Änderung durch

# help:account.configuration,default_dunning_procedure:account_dunning.
source: The default dunning procedure for new customers.
de: Der Standard-Mahnprozess für neue Kunden.

source: The default dunning procedure for new customers.
de: Der Standard-Mahnprozess für neue Kunden.

# help:account.dunning,blocked:account_dunning.
source: Check to block further levels of the procedure.
de: Aktivieren um weiter Mahnstufen zu verhindern.

# help:account.dunning,company:account_dunning.
source: Make the dunning belong to the company.
de: Diese Mahnung dem Unternehmen zuordnen.

# help:account.dunning,line:account_dunning.
source: The receivable line to dun for.
de: Diese Forderung einmahnen.

# help:account.dunning.create.start,date:account_dunning.
source: Create dunning up to this date.
de: Mahnungen bis zu diesem Stichtag erstellen.

# help:account.dunning.level,overdue:account_dunning.
source: When the level should be applied.
de: Wann die Mahnstufe angewendet werden soll.

# help:account.dunning.procedure,name:account_dunning.
source: The main identifier of the Dunning Procedure.
de: Das Hauptidentifizierungsmerkmal des Mahnprozesses.

# model:account.configuration.default_dunning_procedure,name:account_dunning.
source: Account Configuration Default Dunning Procedure
de: Einstellungen Buchhaltung Standardmahnprozess

# model:account.dunning,name:account_dunning.
source: Account Dunning
de: Mahnung

# model:account.dunning.create.start,name:account_dunning.
source: Create Account Dunning
de: Mahnung erstellen

# model:account.dunning.level,name:account_dunning.
source: Account Dunning Level
de: Mahnstufe

# model:account.dunning.procedure,name:account_dunning.
source: Account Dunning Procedure
de: Buchhaltung Mahnprozess

# model:account.dunning.process.start,name:account_dunning.
source: Create Account Dunning
de: Mahnung erstellen

# model:ir.action,name:account_dunning.act_dunning_form
source: Dunnings
de: Mahnungen

# model:ir.action,name:account_dunning.act_dunning_party
source: Dunnings
de: Mahnungen

# model:ir.action,name:account_dunning.act_dunning_procedure_form
source: Dunning Procedures
de: Mahnprozesse

# model:ir.action,name:account_dunning.wizard_dunning_create
source: Create Dunnings
de: Mahnungen erstellen

# model:ir.action,name:account_dunning.wizard_dunning_process
source: Process Dunning
de: Mahnlauf durchführen

source: All
de: Alle

source: Draft
de: Entwurf

source: Final
de: Ausgemahnt

source: Waiting
de: Wartend

# model:ir.message,text:account_dunning.msg_dunning_line_unique
source: Line can be used only once on dunning.
de: Eine Position kann nur einmal auf einer Mahnung verwendet werden.

# model:ir.rule.group,name:account_dunning.rule_group_dunning
source: User in company
de: Benutzer im Unternehmen

# model:ir.ui.menu,name:account_dunning.menu_dunning_configuration
source: Dunnings
de: Mahnungen

# model:ir.ui.menu,name:account_dunning.menu_dunning_create
source: Create Dunnings
de: Mahnungen erstellen

# model:ir.ui.menu,name:account_dunning.menu_dunning_form
source: Dunnings
de: Mahnungen

# model:ir.ui.menu,name:account_dunning.menu_dunning_procedure_form
source: Dunning Procedures
de: Mahnprozesse

# model:ir.ui.menu,name:account_dunning.menu_dunnings
source: Dunnings
de: Mahnungen

# model:party.party.dunning_procedure,name:account_dunning.
source: Party Dunning Procedure
de: Partei Standardmahnprozess

# model:res.group,name:account_dunning.group_dunning
source: Dunning
de: Mahnung

# selection:account.dunning,state:account_dunning.
source: Draft
de: Entwurf

# selection:account.dunning,state:account_dunning.
source: Final
de: Ausgemahnt

# selection:account.dunning,state:account_dunning.
source: Waiting
de: Wartend

# view:account.configuration:account_dunning.
source: Dunning
de: Mahnung

# view:account.dunning.create.start:account_dunning.
source: Create Dunning for date
de: Mahnung erstellen für Datum

# view:account.dunning.process.start:account_dunning.
source: Process Dunning?
de: Mahnlauf durchführen?

# view:party.party:account_dunning.
source: Dunning
de: Mahnung

# wizard_button:account.dunning.create,start,create_:account_dunning.
source: Create
de: Erstellen

# wizard_button:account.dunning.create,start,end:account_dunning.
source: Cancel
de: Abbrechen

# wizard_button:account.dunning.process,start,end:account_dunning.
source: Cancel
de: Abbrechen

# wizard_button:account.dunning.process,start,process:account_dunning.
source: Process
de: Ausführen
