Repository: pypi-data/pypi-mirror-139
Catalog: packages/m9s-translation-override-*/m9s_translation_override_*-6.0.0.tar.gz/m9s_translation_override_*-6.0.0/locale/override/sale_shipment_tolerance_*.po
Languages: de

# field:sale.configuration,sale_over_shipment_tolerance:sale_shipment_tolerance.
source: Sale Over Shipment Tolerance
de: Obere Liefertoleranz im Verkauf

# field:sale.configuration,sale_under_shipment_tolerance:sale_shipment_tolerance.
source: Sale Under Shipment Tolerance
de: Untere Liefertoleranz im Verkauf

# field:sale.configuration.shipment_tolerance,create_date:sale_shipment_tolerance.
source: Create Date
de: Erstellungsdatum

# field:sale.configuration.shipment_tolerance,create_uid:sale_shipment_tolerance.
source: Create User
de: Erstellt durch

# field:sale.configuration.shipment_tolerance,rec_name:sale_shipment_tolerance.
source: Record Name
de: Name

source: Sale Over Shipment Tolerance
de: Obere Liefertoleranz im Verkauf

source: Sale Under Shipment Tolerance
de: Untere Liefertoleranz im Verkauf

# field:sale.configuration.shipment_tolerance,write_date:sale_shipment_tolerance.
source: Write Date
de: Zuletzt geändert

# field:sale.configuration.shipment_tolerance,write_uid:sale_shipment_tolerance.
source: Write User
de: Letzte Änderung durch

# help:sale.configuration,sale_over_shipment_tolerance:sale_shipment_tolerance.
source: The upper quantity accepted in percentage.
de: Die Obergrenze der akzeptierten Menge in Prozent.

# help:sale.configuration,sale_under_shipment_tolerance:sale_shipment_tolerance.
source: The lower quantity accepted in percentage.
de: Die Untergrenze der akzeptierten Menge in Prozent.

source: The upper quantity accepted in percentage.
de: Die Obergrenze der akzeptierten Menge in Prozent.

source: The lower quantity accepted in percentage.
de: Die Untergrenze der akzeptierten Menge in Prozent.

# model:ir.message,text:sale_shipment_tolerance.msg_over_shipment
source: The sale line "%(line)s" exceeds the over shipment tolerance.
de: Die Verkaufsposition "%(line)s" überschreitet die Überlieferungstoleranz.

# model:sale.configuration.shipment_tolerance,name:sale_shipment_tolerance.
source: Sale Configuration Shipment Tolerance
de: Einstellungen Liefertoleranzen im Verkauf

# view:sale.configuration:sale_shipment_tolerance.
source: Sale Shipment Tolerance
de: Liefertoleranz im Verkauf
