Repository: pypi-data/pypi-mirror-139
Catalog: packages/ajenti.plugin.check-certificates/ajenti.plugin.check_certificates-0.8.tar.gz/ajenti.plugin.check_certificates-0.8/ajenti_plugin_check_certificates/locale/*/LC_MESSAGES/app.po
Languages: tr

source: ({{h.restTime}} days)
tr: ({{h.restTime}} günler)

source: <i class="fas fa-check"></i> All certificates are up to date !
tr: <i class="fas fa-check"></i> Tüm sertifikalar güncel !

source: Add host
tr: Host ekle

source: Certificates to be renewed
tr: Yenilenecek sertifikalar

source: Certificates
tr: Sertifikalar

source: Check certificates
tr: Sertifikaları kontrol edin

source: New url
tr: Yeni bağlantı

source: Remove the url
tr: Bağlantıyı kaldır

source: Remove
tr: Kaldır

source: Cancel
tr: Vazgeç
