from liukai.文件文本 import *


def test_文件夹_遍历文件夹():
    文件夹_遍历文件夹(r"C:\新建文件夹")

    # C:\新建文件夹\文件夹1
    # C:\新建文件夹\文件夹2
    # C:\新建文件夹\文件夹4
    # C:\新建文件夹\文件夹1\子文件夹1
    # C:\新建文件夹\文件夹2\文件夹2_子


def test_文件夹_遍历_只当前层():
    rootdir = r"C:\新建文件夹"
    文件夹_遍历_只当前层(rootdir)

    # ['哼哼哈嘿.测试', '文件1 - 副本.txt', '文件1.txt', '文件2.txt', '文件夹1', '文件夹2', '文件夹4', '文本123_被移动文件.txt', '测试_']


def test_文件夹_遍历_可打印目录树文本():
    rootdir = r"C:\新建文件夹"
    文件夹_遍历_可打印目录树文本(rootdir)

    r"""
     rootdir = r"C:\新建文件夹"

     C:\新建文件夹
     │--哼哼哈嘿.测试
     │--文件1 - 副本.txt
     │--文件1.txt
     │--文件2.txt
     │--文件夹1
     │  │--子文件夹1
     │  │  │--3
     │  │--子文件文件1.txt
     │  │--子文件文件3333.txt
     │  │--子文件文件3333_.txt
     │--文件夹2
     │  │--文件夹2_子
     │  │  │--文件夹2_子_子.txt
     │  │--文件夹2_子.rtf
     │  │--文本123_新移动文件.txt
     │--文件夹4
     │--文本123_被移动文件.txt
     │--测试_
     """


def test_文件夹_清空():
    path = r"c:\新建文件夹 - 副本"
    文件夹_清空(path)


def test_文件夹_文件夹_删除_自己写的():
    path = r"C:\新建文件夹_复制_测试删除"
    文件夹_删除_自己写的(path)


def test_文件夹_删除():
    path = r"C:\新建文件夹_复制_测试删除"
    文件夹_删除(path)
